{
  "app_name": "Marvin Zavaleta - Portfolio",
  "home": "Inicio",
  "about": "Sobre mí",
  "projects": "Proyectos",
  "awards": "Certificaciones",
  "blog": "Blog",
  "skills": "Habilidades",
  "contact": "Contacto",
  "contact_me": "Contáctame",
  "dev_email": "zavaleta.marvin@gmail.com",
  "intro": "Hola! Soy Marvin Zavaleta",
  "position": "Flutter Developer &",
  "position_2": "Data Scientist",
  "about_dev": "Desarrollo apps móviles y web con enfoque fullstack y visión estratégica. Especializado en Flutter, Firebase y ciencia de datos con Python. Combino código con negocio para construir soluciones modernas, escalables y centradas en el usuario.",
  "download_cv": "Descarga CV",
  "email": "Email",
  "whatsapp": "WhatsApp",
  "location": "Ubicación",
  "hire_me_now": "Contrátame",
  "app_dev": "App Developer",
  "app_dev_desc": "Construyo apps desde cero para Android, iOS y web",
  "data_sci": "Data Scientist",
  "data_sci_desc": "Aplico ciencia de datos para entender y predecir el comportamiento de los usuarios",
  "mvp_builder": "MVP Builder",
  "mvp_builder_desc": "Te ayudo a lanzar tu idea al mercado en poco tiempo",
  "about_me": "Acerca de mi",
  "about_me_desc": "Desarrollador Flutter fullstack con base en ingeniería industrial y certificación en ciencia de datos por IBM. He liderado proyectos como MIJI Markets, una plataforma de e-commerce con app móvil y panel web, y he aplicado análisis de datos reales para identificar patrones de compra, optimizar operaciones y entender el comportamiento de los clientes. Me apasiona crear tecnología útil, combinando habilidades técnicas, pensamiento analítico y visión de negocio.",
  "creative_design": "Tecnología con propósito.",
  "help": "Datos con impacto.",
  "my_skills": "mis habilidades",
  "skills_title_1": "Las herramientas que uso",
  "skills_title_2": "para construir soluciones",
  "skills_desc": "Desarrollo aplicaciones y sistemas conectando frontend, backend y análisis de datos. Utilizo Flutter, Firebase y Python para crear experiencias robustas y con impacto.",
  "tools_1_name": "Flutter & Dart",
  "tools_1_proficiency": "90%",
  "tools_2_name": "Firebase & Google Cloud",
  "tools_2_proficiency": "85%",
  "tools_3_name": "PostgreSQL & SQL",
  "tools_3_proficiency": "60%",
  "tools_4_name": "Data Science (Python, Pandas, NumPy, Scikit-Learn)",
  "tools_4_proficiency": "80%",
  "tools_5_name": "Data Visualization (Matplotlib, Seaborn)",
  "tools_5_proficiency": "70%",
  "tools_6_name": "Business Insight & Decision Making",
  "tools_6_proficiency": "70%",
  "skills_1": "Flutter Developer",
  "skills_1_desc": "Apps móviles y web escalables",
  "skills_2": "Firebase Architect",
  "skills_2_desc": "Auth, Firestore, AppCheck, Functions",
  "skills_3": "Data Scientist (Python)",
  "skills_3_desc": "Análisis de datos y visualización",
  "skills_4": "SQL & Data Analysis",
  "skills_4_desc": "Análisis con SQL en Firestore Export o BigQuery",
  "meet_my_projects": "Conoce mis proyectos",
  "my_works": "Portafolio",
  "projects_desc": "Aquí encontrarás una selección de mis proyectos desarrollados en distintas áreas del desarrollo de software y análisis de datos. Cada uno refleja mi enfoque técnico, creativo y orientado a resultados.",
  "all_projects": "Todos ",
  "all": "Todos",
  "web_development": "Web Development",
  "mobile_development": "Mobile Development",
  "data_analytics": "Data Analytics",
  "data_science": "Data Science",
  "portfolio_1_title": "Miji Markets Admin Panel Web",
  "portfolio_2_title": "Miji Markets Mobil App",
  "portfolio_3_title": "Miji Markets Landing Page",
  "portfolio_4_title": "Miji Markets Demand & BCG Tool",
  "portfolio_5_title": "Tec Langind Page",
  "my": "Mis",
  "cv": "Certificados",
  "my_awards": "Mi Formación",
  "awards_title": "Formación Académica",
  "awards_desc": "Desde 2024 estoy construyendo una carrera híbrida en desarrollo de software y ciencia de datos, complementando mi formación en ingeniería industrial y mi experiencia en áreas comerciales",
  "awards_type_title_1": "Formación",
  "awards_type_title_2": "Awards",
  "awards_1": "Ingeniería Industrial - Universidad Privada del Norte (2008 - 2013)",
  "awards_2": "PAE Dirección Comercial y Ventas - ESAN Graduate School of Business (2018)",
  "awards_3": "Data Science Professional Certificate - IBM by Coursera (2024)",
  "awards_4": "Full Stack Cloud Developer Professional Certificate - IBM by Coursera (En progreso)",
  "lets_talk": "¡Conversemos!",
  "phone_me": "Contáctame",
  "phone_number": "+51 977 683 001",
  "mail_me": "Escríbeme",
  "follow_me_2": "Sígueme",
  "follow_me_2_url": "https://github.com/marzava91",
  "hire_me": "Contrátame",
  "not_found_title": "404 - Página no encontrada",
  "not_found_description": "La página que buscas no existe o fue movida. Verifica la dirección o regresa al inicio.",
  "go_home": "Volver al inicio",
  "under_construction": "⚠️ Página en construcción. Pronto mostraremos imágenes, fragmentos de código, enlaces de prueba interactivos y una descripción de funcionalidades implementadas y por implementar.",

  "tec_landing_title": "Tec Landing Page",
  "tec_landing_intro": "Esta plataforma web fue desarrollada para apoyar la organización del Carnaval de Cajamarca. A través de ella se ofreció información detallada del evento y la venta de polos oficiales. El sistema cuenta con un formulario conectado a Firebase que permite registrar pedidos y gestionar evidencias de pago manualmente, dado que no se utilizó una pasarela de pagos por tratarse de un evento puntual. Además, se desarrolló un intranet administrativo donde se validan pagos, se notifican automáticamente a los usuarios vía correo y se puede exportar la lista de pedidos a Excel para una mejor gestión.",
  "tec_landing_stack_title": "Tecnologías utilizadas",
  "tec_landing_stack_items": "React, Next.js, Firebase, Tailwind CSS, JavaScript, NodeMailer, Vercel, Excel Export",

  "miji_analytics_title": "Miji Markets Analytics",
  "miji_analytics_intro": "Miji Analytics es una herramienta de análisis de datos desarrollada para estimar la demanda semanal de productos y optimizar la toma de decisiones comerciales en Miji Markets. A partir de archivos extraídos manualmente del sistema de ventas actual (que no ofrece acceso al backend), el sistema integra información de compras, ventas y productos vigentes utilizando Python en Google Colab. Analiza métricas clave como ventas diarias, ventas semanales, ticket promedio, horarios y días de mayor venta, y clasifica los productos según su rentabilidad y rotación en una matriz BCG (Estrellas, Vacas, Interrogantes, Perros). Esta clasificación permite ajustar dinámicamente la demanda y proyectar órdenes de compra automáticas segmentadas por proveedor.",
  "miji_analytics_stack_title": "Tecnologías utilizadas",
  "miji_analytics_stack_items": "Python, Google Colab, Pandas, NumPy, Matplotlib, Seaborn, OpenPyXL, Jupyter, Data Visualization",

  "miji_landing_title": "Miji Markets Langing Page",
  "miji_landing_intro": "Esta landing page fue desarrollada con Flutter Web y funciona como el punto de entrada oficial para los usuarios de Miji Markets. Desde aquí, pueden descargar la app y revisar nuestros documentos legales. Próximamente, los usuarios también podrán enviar comentarios o reclamos directamente desde este sitio.",
  "miji_landing_stack_title": "Tecnologías utilizadas",
  "miji_landing_stack_items": "Flutter Web, Dart, GoRouter, Responsive Framework, Easy Localization, Iconsax, Hosting en Vercel",
  "visit_website": "Visitar sitio web",

  "miji_admin_title": "Miji Markets Admin Panel",
  "miji_admin_intro": "Esta aplicación web interna, desarrollada con Flutter Web, es el panel central para gestionar todas las operaciones de la app móvil Miji Markets. Desde aquí, los colaboradores pueden subir productos, imágenes, banners, categorías y marcas. También permite gestionar clientes y pedidos para editarlos, empacarlos y confirmar su entrega.",
  "miji_admin_stack_title": "Tecnologías utilizadas",
  "miji_admin_stack_items": "Flutter Web, Dart, Firebase Auth, Cloud Firestore, Firebase Storage, Firebase Messaging, Firebase App Check, GetX, GetStorage, Lottie, Shimmer, PDF & Printing, Excel, File Picker, CSV, DataTable2, FlChart, Flutter Dropzone, TypeAhead, Multi Select Flutter, Iconsax, Hosting en Vercel",

  "miji_mobile_title": "App Móvil Miji Markets",
  "miji_mobile_intro": "Esta aplicación móvil, desarrollada con Flutter, está disponible en Android e iOS. Ofrece una experiencia de compra intuitiva y ágil, permitiendo a los usuarios explorar productos, realizar pedidos, programar entregas, gestionar métodos de pago, recibir notificaciones, acceder a descuentos y más.",
  "miji_mobile_stack_title": "Tecnologías utilizadas",
  "miji_mobile_stack_items": "Flutter, Dart, Firebase Core, Firebase Auth, Firestore, Firebase Storage, Firebase Crashlytics, Firebase App Check, Google Sign In, Geolocator, Google Maps, App Tracking Transparency, GetX, GetStorage, Hive, Shared Preferences, Lottie, Shimmer, Carousel Slider, Flutter Rating Bar, Readmore, Path Provider, Smooth Page Indicator, Permission Handler, Iconsax, FontAwesome, URL Launcher, Flutter Native Splash, CSV, Excel, Mailer",
  "miji_mobile_download_link": "Descargar la app",
  "miji_mobile_download_note": "Disponible sólo en Perú (Android e iOS)"
}