{
  "app_name": "Marvin Zavaleta - Portfolio",
  "home": "Home",
  "about": "About Me",
  "projects": "Projects",
  "awards": "Certifications",
  "blog": "Blog",
  "skills": "Skills",
  "contact": "Contact",
  "contact_me": "Contact Me",
  "dev_email": "zavaleta.marvin@gmail.com",
  "intro": "Hi! I'm Marvin Zavaleta",
  "position": "Flutter Developer &",
  "position_2": "Data Scientist",
  "about_dev": "I build mobile and web applications with a full-stack approach and strategic mindset. I specialize in Flutter, Firebase, and data science with Python. I merge technical expertise with business acumen to deliver modern, scalable, and user-centric solutions.",
  "download_cv": "Download CV",
  "email": "Email",
  "whatsapp": "WhatsApp",
  "location": "Location",
  "hire_me_now": "Hire Me",
  "app_dev": "App Developer",
  "app_dev_desc": "I build Android, iOS, and web apps from the ground up.",
  "data_sci": "Data Scientist",
  "data_sci_desc": "I apply data science to understand and predict user behavior",
  "mvp_builder": "MVP Builder",
  "mvp_builder_desc": "I help you bring your idea to market in record time.",
  "about_me": "About Me",
  "about_me_desc": "Fullstack Flutter developer with a background in industrial engineering and IBM certification in data science. I've led projects like MIJI Markets, a platform with mobile app and web dashboard, and applied real-world data analysis to identify purchasing patterns, optimize operations, and understand customer behavior. I’m passionate about building useful tech by combining technical skills, analytical thinking, and business vision.",
  "creative_design": "Technology with purpose.",
  "help": "Data with impact.",
  "my_skills": "my skills",
  "skills_title_1": "The tools I use",
  "skills_title_2": "to build solutions",
  "skills_desc": "I develop applications and systems connecting frontend, backend, and data analytics. I use Flutter, Firebase, and Python to build robust and impactful experiences.",
  "tools_1_name": "Flutter & Dart",
  "tools_1_proficiency": "90%",
  "tools_2_name": "Firebase & Google Cloud",
  "tools_2_proficiency": "85%",
  "tools_3_name": "PostgreSQL & SQL",
  "tools_3_proficiency": "60%",
  "tools_4_name": "Data Science (Python, Pandas, NumPy, Scikit-Learn)",
  "tools_4_proficiency": "80%",
  "tools_5_name": "Data Visualization (Matplotlib, Seaborn)",
  "tools_5_proficiency": "70%",
  "tools_6_name": "Business Insight & Decision Making",
  "tools_6_proficiency": "70%",
  "skills_1": "Flutter Developer",
  "skills_1_desc": "Scalable mobile and web apps",
  "skills_2": "Firebase Architect",
  "skills_2_desc": "Auth, Firestore, AppCheck, Functions",
  "skills_3": "Data Scientist (Python)",
  "skills_3_desc": "Data analysis and visualization",
  "skills_4": "SQL & Data Analysis",
  "skills_4_desc": "SQL analysis on Firestore Export or BigQuery",
  "meet_my_projects": "Meet My Projects",
  "my_works": "Portfolio",
  "projects_desc": "Here you’ll find a selection of my projects across software development and data analysis. Each one reflects my technical, creative, and results-driven mindset.",
  "all_projects": "All",
  "all": "All",
  "web_development": "Web Development",
  "mobile_development": "Mobile Development",
  "data_analytics": "Data Analytics",
  "data_science": "Data Science",
  "portfolio_1_title": "Miji Markets Admin Panel Web",
  "portfolio_2_title": "Miji Markets Mobile App",
  "portfolio_3_title": "Miji Markets Landing Page",
  "portfolio_4_title": "Miji Markets Demand & BCG Tool",
  "portfolio_5_title": "Tec Landing Page",
  "my": "My",
  "cv": "Certificates",
  "my_awards": "My Education",
  "awards_title": "Academic Background",
  "awards_desc": "Since 2024 I’ve been building a hybrid career in software development and data science, complementing my industrial engineering education and commercial experience.",
  "awards_type_title_1": "Education",
  "awards_type_title_2": "Awards",
  "awards_1": "Industrial Engineering - Universidad Privada del Norte (2008 - 2013)",
  "awards_2": "PAE in Sales & Commercial Management - ESAN Graduate School of Business (2018)",
  "awards_3": "Data Science Professional Certificate - IBM by Coursera (2024)",
  "awards_4": "Full Stack Cloud Developer Professional Certificate - IBM by Coursera (In progress)",
  "lets_talk": "Let's Talk!",
  "phone_me": "Contact Me",
  "phone_number": "+51 977 683 001",
  "mail_me": "Write Me",
  "follow_me_2": "Follow Me",
  "follow_me_2_url": "https://github.com/marzava91",
  "hire_me": "Hire me",
  "not_found_title": "404 - Page not found",
  "not_found_description": "The page you’re looking for doesn’t exist or has been moved. Check the address or return to the homepage.",
  "go_home": "Go back to home",
  "under_construction": "⚠️ Page under construction. Soon we'll include screenshots, code snippets, interactive test links, and a description of implemented and upcoming features.", 
  
  "tec_landing_title": "Tec Landing Page",
  "tec_landing_intro": "This web platform was developed to support the organization of the Carnaval of Cajamarca. It provides detailed information about the event and manages the sale of official t-shirts. The system includes a Firebase-connected form to register orders and manually validate payment evidence, since no payment gateway was used due to the one-time nature of the event. An internal admin panel was also built to validate payments, send automated email notifications, and export the order list to Excel for better management.",
  "tec_landing_stack_title": "Technologies used",
  "tec_landing_stack_items": "React, Next.js, Firebase, Tailwind CSS, JavaScript, NodeMailer, Vercel, Excel Export",

  "miji_analytics_title": "Miji Analytics",
  "miji_analytics_intro": "Miji Analytics is a data analytics tool developed to estimate weekly product demand and optimize decision-making at Miji Markets. Based on manually exported files from the current POS system (which lacks backend access), the system integrates purchase, sales, and product catalog data using Python in Google Colab. It analyzes key metrics such as daily and weekly sales, average ticket size, peak sales hours and days, and classifies products using a BCG Matrix (Stars, Cash Cows, Question Marks, Dogs) based on their profitability and turnover. This classification enables dynamic demand adjustment and the projection of automated purchase orders segmented by supplier.",
  "miji_analytics_stack_title": "Technologies used",
  "miji_analytics_stack_items": "Python, Google Colab, Pandas, NumPy, Matplotlib, Seaborn, OpenPyXL, Jupyter, Data Visualization",

  "miji_landing_title": "Miji Markets Langing Page",
  "miji_landing_intro": "This landing page was developed using Flutter Web and serves as the official entry point for Miji Markets users. From here, users can download the app and review our legal documents. Soon, users will also be able to submit comments or complaints directly through this site.",
  "miji_landing_stack_title": "Technologies used",
  "miji_landing_stack_items": "Flutter Web, Dart, GoRouter, Responsive Framework, Easy Localization, Iconsax, Vercel Hosting",
  "visit_website": "Visit live website",

  "miji_admin_title": "Miji Markets Admin Panel",
  "miji_admin_intro": "This internal web application, developed with Flutter Web, is the central panel for managing all operations of the Miji Markets Mobile App. From here, collaborators can upload products, images, banners, categories, and brands. It also allows managing clients and orders for editing, packaging, and delivery confirmation.",
  "miji_admin_stack_title": "Technologies used",
  "miji_admin_stack_items": "Flutter Web, Dart, Firebase Auth, Cloud Firestore, Firebase Storage, Firebase Messaging, Firebase App Check, GetX, GetStorage, Lottie, Shimmer, PDF & Printing, Excel, File Picker, CSV, DataTable2, FlChart, Flutter Dropzone, TypeAhead, Multi Select Flutter, Iconsax, Vercel Hosting",

  "miji_mobile_title": "Miji Markets Mobile App",
  "miji_mobile_intro": "This mobile application, developed using Flutter, is available on Android and iOS. It provides an intuitive and fast shopping experience, allowing users to browse products, place orders, schedule deliveries, manage payment methods, receive notifications, access discounts, and more.",
  "miji_mobile_stack_title": "Technologies used",
  "miji_mobile_stack_items": "Flutter, Dart, Firebase Core, Firebase Auth, Firestore, Firebase Storage, Firebase Crashlytics, Firebase App Check, Google Sign In, Geolocator, Google Maps, App Tracking Transparency, GetX, GetStorage, Hive, Shared Preferences, Lottie, Shimmer, Carousel Slider, Flutter Rating Bar, Readmore, Path Provider, Smooth Page Indicator, Permission Handler, Iconsax, FontAwesome, URL Launcher, Flutter Native Splash, CSV, Excel, Mailer",
  "miji_mobile_download_link": "Download the app",
  "miji_mobile_download_note": "Available only in Peru (Android & iOS)"

}